'''
Реализовать функцию get_jokes(), возвращающую n шуток, сформированных из трех
случайных слов, взятых из трёх списков (по одному из каждого):
nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
adjectives = ["веселый", "яркий", "зеленый", "утопичный",
"мягкий"]
Например:
# >>> get_jokes(2)
["лес завтра зеленый", "город вчера веселый"]
'''
import random

nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
adjectives = ["веселый", "яркий", "зеленый", "утопичный","мягкий"]

# def get_jokes(beginning, middle, end):
beginning = random.choice(nouns)
middle = random.choice(adverbs)
end = random.choice(adjectives)
print(f'{beginning} {middle} {end}')

    # return (f'{beginning} {middle} {end}')


# if __name__ == "__main__":
#     print(get_jokes(2))

"""
Придумал данный вариант решения и ничего другое не лезет в голову
"""